import instagram from "../../assets/instagram.svg";
import telegram from "../../assets/telegram.svg";
import twitter from "../../assets/twitter.svg";
import vk from "../../assets/vk.svg";

const AboutPage = () => {
  return (
    <div>
      <h1 className="page__title">Для чего это вообще ?</h1>
      <div className="about__information">
        <p>Что это за сервис? Как он помогает? Есть ли в нем смысл?</p>
        <p>
          Возможно, это одни из тех вопросов, которые у вас возникнут при первом
          посещении. Постараюсь немного разъяснить и подсказать, какая вообще
          идея.
        </p>
        <p>
          Не буду врать, этот сервис я изначально создавал, чтобы упросить себе
          жизнь. Я слежу за тем, что ем и сколько ем. С обычными магазинными
          продуктами все просто: ты купил продукт, скачал приложение,
          отсканировал штрих-код и оно тебе выдало всю информцию. Но когда
          приходишь в кафе/ресторан, все немного усложняется
        </p>
        <p>
          Ты приходишь в ресторан, просишь расписку КБЖУ по блюдам, и будет
          счастьем, если она имеется. Дальше ищешь еду, которую планируешь
          съесть, высчитываешь количество КБЖУ (если там указана информация на
          100 грамм), все складываешь и вуаяля! Вся нужная информация у тебя
          есть, но процесс занимает определенное время. И так при каждом
          посещении заведения! Можно, конечно, сфотографировать все на телефон,
          но поиск фотографии для меня тоже длительный процесс.
        </p>
        <p>
          И вот, спустя пару таких походов моя терпилка и лень стали
          поскрипывать. Так и родилась идея этого сервиса.
        </p>
        <p>
          Здесь вы сможете найти нужное блюдо, добавить в корзину то, что будете
          кушать, сказать мне, что с данными что-то не то/они изменились,
          добавить новое, добавить блюдо в избранное! И дальше функций будет еще
          больше!
        </p>
        <p>
          Это только начальная заготовка, которая будет расширяться. И я буду
          очень рад, если это веб-приложение найдет отклик у вас в сердечку, ну
          или в мобильном телефоне.
        </p>
        <p>
          Ресторанов существует безумное количество и мне одному будет
          практически невозможно собрать всю базу. Если у вас есть информация,
          фотографии или какие-либо данные, пожалуйста, присылайте их внутри
          приложения! Я буду бузмно благодарен. Это поможет развиваться и
          создавать еще более удобное и полезное приложение.
        </p>
        <p className="centered">
          Спасибо за внимание и приятного пользования :)
        </p>
      </div>
      <div className="about__icons">
        <a
          className="about__icon-link"
          href="https://www.instagram.com/mityai_shamal/"
          target="_blank"
          rel="noreferrer"
        >
          <img src={instagram} alt="" className="about__icon" />
        </a>
        <a
          className="about__icon-link"
          href="https://telegram.me/mityai_shamal"
          target="_blank"
          rel="noreferrer"
        >
          <img src={telegram} alt="" className="about__icon" />
        </a>
        <a
          className="about__icon-link"
          href="https://vk.com/id44102242"
          target="_blank"
          rel="noreferrer"
        >
          <img src={vk} alt="" className="about__icon" />
        </a>
        <a
          className="about__icon-link"
          href="https://twitter.com/mityai_igorevic"
          target="_blank"
          rel="noreferrer"
        >
          <img src={twitter} alt="" className="about__icon" />
        </a>
      </div>
    </div>
  );
};

export default AboutPage;
